app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Bagus?"], ["user_id", 1], ["created_at", "2015-07-12 13:02:29.972232"], ["updated_at", "2015-07-12 13:02:29.972232"]]
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "question" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["question", "Suka post ini?"], ["updated_at", "2015-07-12 13:10:43.390120"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def upvote
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def downvote
    @post = Post.find(params[:id])